#if 0
#include "线性表_顺序表.h"
#include "线性表_链表.h"

#endif
/*
按照C99标准即可编译，主要是在for(int i=0;i<5;i++)中，不能这样声明形参，需要在函数前或者()后声明
如
for(i=0;i<5;i++)  int i;
{...}
这样也可以。
*/

//顺序表：增、删、改、查。
#if 0

int main(){
	table t1=initTable();
	for (int i=1; i<=Size; i++) {
		t1.head[i-1]=i;
		t1.length++;
	}
	printf("原顺序表：\n");
	displayTable(t1);

	printf("删除元素1:\n");
	t1=delTable(t1, 1);
	displayTable(t1);

	printf("在第2的位置插入元素5:\n");
	t1=addTable(t1, 2, 5);
	displayTable(t1);

	printf("查找元素3的位置:\n");
	int add=selectTable(t1, 3);
	printf("%d\n",add);

	printf("将元素数据3改为6:\n");
	t1=amendTable(t1, 3, 6);
	displayTable(t1);
	return 0;
}

#endif

/************************************************************************/
/* 顺序栈

顺序栈的实现采用的是数组。

在顺序栈中设定一个随时指向栈顶元素的变量（一般命名为 top ），当 top 的值为 -1 时，说明数组中没有数据，即栈中没有数据元素，为“空栈”；只要数据元素进栈，top 就加 1 ；数据元素出栈， top 就减 1 。

例如，使用顺序栈的存储结构将（’a’,’b’,’c’,’d’）四个元素逐个压栈并输出栈顶元素。

实现代码：   */
/************************************************************************/

#if 0
#include "顺序栈-入栈出栈.h"

int main() {
	char i=127;//有符号范围为：-128~127，且超过127范围后从-128开始递增；如果为uchar则范围为：0~255，并且超过255范围后为0,1,2...
	i=i+1;

	Stack_Test();

	printf_s("%d\t%d\t%d\n",i,i+1,i+2);//-128，-127，-126
	return 0;
}

#endif
/************************************************************************/
/* 密码回显‘*’  */
/************************************************************************/

#if 0
#include<stdio.h>
#include<conio.h>

int main(void)
{
	int x='A';
	int n=0;
	char ch[10] = {0};
	int i ; 
	for (i = 0; i < 10;i++) //输入一个字符保存起来输出个*				
	{
		//printf_s("请输入十个字符以内的密码：\n");
		ch[i] = _getch();
		if (ch[i] == '\r')
		{
			break;
		}
		printf("*");
		n++;
	}
	printf("\n");

	for (i = 0; i < n; i++)  //把真正的密码打印一下
	{
		printf("%c", ch[i]);
	}
	_getch();
	printf_s("\n");
	printf_s("%c\n",x);
	return 0;
}

#endif

/************************************************************************/
/*  字符串的三种存储结构——定长顺序存储——堆分配存储 */
/************************************************************************/

#include "字符串-定长顺序存储-堆分配存储.h"


void main()
{
	void strConfig();

}